Revit 2024 API
StructuralSectionGeneralC Constructor
 Creates a new instance of general Channel Cold Formed shape.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public StructuralSectionGeneralC(
	double width,
	double height,
	double wallNominalThickness,
	double wallDesignThickness,
	double innerFillet,
	double lipLength,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Visual Basic
Public Sub New ( _
	width As Double, _
	height As Double, _
	wallNominalThickness As Double, _
	wallDesignThickness As Double, _
	innerFillet As Double, _
	lipLength As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	analysisParams As StructuralSectionAnalysisParams _
)
Visual C++
public:
StructuralSectionGeneralC(
	double width,
	double height,
	double wallNominalThickness,
	double wallDesignThickness,
	double innerFillet,
	double lipLength,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
Parameters
width
Type: System.Double
 Section width.
height
Type: System.Double
 Section height, depth.
wallNominalThickness
Type: System.Double
 Represents wall nominal thickness of rectangle.
wallDesignThickness
Type: System.Double
 Represents wall design thickness of rectangle.
innerFillet
Type: System.Double
 Inner Fillet - Corner fillet inner radius.
lipLength
Type: System.Double
 Lip segment length.
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
StructuralSectionGeneralC Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace